/* errAuthorizationInvalidSet */
"-60001" = "認証権が正しくありません。";

/* errAuthorizationInvalidRef */
"-60002" = "認証の参照が正しくありません。";

/* errAuthorizationInvalidTag */
"-60003" = "認証のタグが正しくありません。";

/* errAuthorizationInvalidPointer */
"-60004" = "返ってきた認証が正しくありません。";

/* errAuthorizationDenied */
"-60005" = "認証が拒否されました。";

/* errAuthorizationCanceled */
"-60006" = "認証はユーザによってキャンセルされました。";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "ユーザ操作が許可されていなかったため、認証は拒否されました。";

/* errAuthorizationInternal */
"-60008" = "この操作の認証を得ることができません。";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "認証は外部フォーマットに変換することはできません。";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "認証は外部フォーマットから作成することはできません。";

/* errAuthorizationInvalidFlags */
"-60011" = "提供されたオプションフラッグは、この認証プロセスには無効です。";

/* errAuthorizationToolExecuteFailure */
"-60031" = "指定されたプログラムは実行できませんでした。";

/* errAuthorizationToolEnvironmentError */
"-60032" = "権限ツールの実行中に無効なステータスが返されました。";

/* errAuthorizationBadAddress */
"-60033" = "要求されたソケットアドレスは無効です（0〜1023 の範囲でなければなりません）";

/* errSSLProtocol */
"-9800" = "SSL プロトコルエラー";

/* errSSLNegotiation */
"-9801" = "Cipher Suite ネゴシエーションエラー";

/* errSSLFatalAlert */
"-9802" = "致命的な警告";

/* errSSLWouldBlock */
"-9803" = "致命的ではありませんが、I/O がブロックされます";

/* errSSLSessionNotFound */
"-9804" = "不明なセッションを復元しようとしました";

/* errSSLClosedGraceful */
"-9805" = "接続は正常に切断されました";

/* errSSLClosedAbort */
"-9806" = "接続はエラーによって切断されました";

/* errSSLXCertChainInvalid */
"-9807" = "無効な証明書チェーン";

/* errSSLBadCert */
"-9808" = "不正な証明書フォーマット";

/* errSSLCrypto */
"-9809" = "基になる暗号化エラー";

/* errSSLInternal */
"-9810" = "内部エラーです";

/* errSSLModuleAttach */
"-9811" = "モジュール接続エラー";

/* errSSLUnknownRootCert */
"-9812" = "証明書チェーンは有効ですが、ルートが信頼されていません";

/* errSSLNoRootCert */
"-9813" = "証明書チェーンがルートによって検証されていません";

/* errSSLCertExpired */
"-9814" = "チェーンの証明書の有効期限が切れていました";

/* errSSLCertNotYetValid */
"-9815" = "チェーンの証明書はまだ有効ではありませんでした";

/* errSSLClosedNoNotify */
"-9816" = "サーバが通知なしでセッションを閉じました";

/* errSSLBufferOverflow */
"-9817" = "供給されたバッファが足りません";

/* errSSLBadCipherSuite */
"-9818" = "不正な SSLCipherSuite";

/* errSSLPeerUnexpectedMsg */
"-9819" = "予期しないメッセージを受信しました";

/* errSSLPeerBadRecordMac */
"-9820" = "不正な MAC";

/* errSSLPeerDecryptionFail */
"-9821" = "暗号解除に失敗しました";

/* errSSLPeerRecordOverflow */
"-9822" = "レコードのオーバーフロー";

/* errSSLPeerDecompressFail */
"-9823" = "伸張エラー";

/* errSSLPeerHandshakeFail */
"-9824" = "ハンドシェイクエラー";

/* errSSLPeerBadCert */
"-9825" = "その他の不正な証明書";

/* errSSLPeerUnsupportedCert */
"-9826" = "サポートされていない不正な証明書のフォーマット";

/* errSSLPeerCertRevoked */
"-9827" = "証明書は取り消されました";

/* errSSLPeerCertExpired */
"-9828" = "証明書の有効期限が切れました";

/* errSSLPeerCertUnknown */
"-9829" = "不明な証明書";

/* errSSLIllegalParam */
"-9830" = "不正なパラメータ";

/* errSSLPeerUnknownCA */
"-9831" = "不明な認証局";

/* errSSLPeerAccessDenied */
"-9832" = "アクセスが拒否されました";

/* errSSLPeerDecodeError */
"-9833" = "デコーディングエラー";

/* errSSLPeerDecryptError */
"-9834" = "暗号解除エラー";

/* errSSLPeerExportRestriction */
"-9835" = "書き出し制限";

/* errSSLPeerProtocolVersion */
"-9836" = "不正なプロトコルバージョン";

/* errSSLPeerInsufficientSecurity */
"-9837" = "セキュリティが不十分です";

/* errSSLPeerInternalError */
"-9838" = "内部エラーです";

/* errSSLPeerUserCancelled */
"-9839" = "ユーザによってキャンセルされました";

/* errSSLPeerNoRenegotiation */
"-9840" = "ネゴシエーションが許可されていません";

/* errSSLServerAuthCompleted */
"-9841" = "サーバの証明書が有効であるか、検証が停止されている場合は無視されました";

/* errSSLClientCertRequested */
"-9842" = "サーバによってクライアントの証明書が要求されました";

/* errSSLHostNameMismatch */
"-9843" = "ピアホスト名の不一致";

/* errSSLConnectionRefused */
"-9844" = "応答の前にピアが接続を解除しました";

/* errSSLDecryptionFail */
"-9845" = "暗号解除エラー";

/* errSSLBadRecordMac */
"-9846" = "不正な MAC";

/* errSSLRecordOverflow */
"-9847" = "レコードのオーバーフロー";

/* errSSLBadConfiguration */
"-9848" = "構成エラー";

/* errSecSuccess */
"0" = "エラーはありません。";

/* errSecUnimplemented */
"-4" = "関数または操作が実装されていません。";

/* errSecParam */
"-50" = "関数に渡された 1 つまたはそれ以上のパラメータが無効でした。";

/* errSecAllocate */
"-108" = "メモリの割り当てに失敗しました。";

/* errSecNotAvailable */
"-25291" = "利用できるキーチェーンがありません。コンピュータの再起動が必要になることがあります。";

/* errSecReadOnly */
"-25292" = "このキーチェーンは変更できません。";

/* errSecAuthFailed */
"-25293" = "入力したユーザ名またはパスフレーズが正しくありません。";

/* errSecNoSuchKeychain */
"-25294" = "指定されたキーチェーンが見つかりませんでした。";

/* errSecInvalidKeychain */
"-25295" = "指定されたキーチェーンは有効なキーチェーンファイルではありません。";

/* errSecDuplicateKeychain */
"-25296" = "同じ名前のキーチェーンがすでに存在します。";

/* errSecDuplicateCallback */
"-25297" = "指定されたコールバック関数はすでにインストールされています。";

/* errSecInvalidCallback */
"-25298" = "指定されたコールバック関数は正しくありません。";

/* errSecDuplicateItem */
"-25299" = "指定された項目はキーチェーン内にすでに存在します。";

/* errSecItemNotFound */
"-25300" = "指定された項目がキーチェーン内に見つかりませんでした。";

/* errSecBufferTooSmall */
"-25301" = "指定された項目を使用するためのメモリが不足しています。";

/* errSecDataTooLarge */
"-25302" = "この項目に含まれている情報は、大きすぎるか表示できないフォーマットです。";

/* errSecNoSuchAttr */
"-25303" = "指定された属性は存在しません。";

/* errSecInvalidItemRef */
"-25304" = "指定された項目はもう有効ではありません。キーチェーンから削除された可能性があります。";

/* errSecInvalidSearchRef */
"-25305" = "現在のキーチェーンを検索できません。";

/* errSecNoSuchClass */
"-25306" = "指定された項目は有効なキーチェーン項目ではないようです。";

/* errSecNoDefaultKeychain */
"-25307" = "デフォルトのキーチェーンが見つかりませんでした。";

/* errSecInteractionNotAllowed */
"-25308" = "ユーザの操作は許可されていません。";

/* errSecReadOnlyAttr */
"-25309" = "指定された属性は変更できません。";

/* errSecWrongSecVersion */
"-25310" = "このキーチェーンは、別のバージョンのシステムソフトウェアで作成されているので開くことができません。";

/* errSecKeySizeNotAllowed */
"-25311" = "この項目で指定されている鍵のサイズが大きすぎます。";

/* errSecNoStorageModule */
"-25312" = "必要なコンポーネント（データ保存モジュール）を読み込めませんでした。コンピュータの再起動が必要になることがあります。";

/* errSecNoCertificateModule */
"-25313" = "必要なコンポーネント（証明書モジュール）を読み込めませんでした。コンピュータの再起動が必要になることがあります。";

/* errSecNoPolicyModule */
"-25314" = "必要なコンポーネント（ポリシーモジュール）を読み込めませんでした。コンピュータの再起動が必要になることがあります。";

/* errSecInteractionRequired */
"-25315" = "ユーザの操作が必要ですが、現在許可されていません。";

/* errSecDataNotAvailable */
"-25316" = "この項目の内容は取り出せません。";

/* errSecDataNotModifiable */
"-25317" = "この項目の内容は変更できません。";

/* errSecCreateChainFailed */
"-25318" = "この証明書の検証に必要な 1 つ以上の証明書が見つかりません。";

/* errSecInvalidPrefsDomain */
"-25319" = "指定された環境設定ドメインが正しくありません。";

/* errSecACLNotSimple */
"-25240" = "指定されたアクセス制御リストは標準（テキスト）のフォーマットではありません。";

/* errSecPolicyNotFound */
"-25241" = "指定されたポリシーが見つかりません。";

/* errSecInvalidTrustSetting */
"-25242" = "指定された信頼設定は無効です。";

/* errSecNoAccessForItem */
"-25243" = "指定された項目にアクセス制御がありません。";

/* errSecInvalidOwnerEdit */
"-25244" = "この項目のオーナーは変更できません。";

/* errSecTrustNotAvailable */
"-25245" = "利用できる信頼結果がありません。";

/* errSecUnsupportedFormat */
"-25256" = "読み込み／書き出しのフォーマットがサポートされていません。";

/* errSecUnknownFormat */
"-25257" = "読み込みのフォーマットが不明です。";

/* errSecKeyIsSensitive */
"-25258" = "鍵材料は書き出すときにラップする必要があります。";

/* errSecMultiplePrivKeys */
"-25259" = "複数の秘密鍵を読み込もうとしました。";

/* errSecPassphraseRequired */
"-25260" = "読み込み／書き出しにはパスフレーズが必要です。";

/* errSecInvalidPasswordRef */
"-25261" = "パスワードの参照が無効です。";

/* errSecInvalidTrustSettings */
"-25262" = "信頼設定レコードが壊れていました。";

/* errSecNoTrustSettings */
"-25263" = "信頼設定が見つかりませんでした。";

/* errSecPkcs12VerifyFailure */
"-25264" = "PKCS12 読み込み中に MAC 検証に失敗しました。";

/* errSecDecode */
"-26275" = "提供されたデータをデコードできません。";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "CSP ベクトル・オブ・バッファのエラー値。";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "CSP 暗号化コンテキストのエラー値。";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "CSP ステージ暗号化 API のエラー値。";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* 公開鍵を使おうとしましたが、アルゴリズム固有のパラメータがないため * 完了できませんでした";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "コード署名が一致しませんでした";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "キーの StartDate/EndDate が無効です";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "キーチェーン同期エラーコード";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "SSLv2 パディングチェック：ロールバック攻撃が検出されました";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "CSSM_DL_DbCreate または CSSM_DL_DbOpen に渡された OpenParameters 引数が、NULL または有効な CSSM_APPLEDL_OPEN_PARAMETERS 構造へのポインタではありませんでした。";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "ディスクが一杯だったため、操作に失敗しました";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "ディスク・クオータを超えたため、操作に失敗しました";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "ファイルが大きすぎたため、操作に失敗しました";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "キーチェーンデータベースの内部情報（“blob”）が無効です";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "データベースの内部情報（“blob”）の内部データフォーマットが無効です";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "ホスト名が一致しません";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "重要フラグが true に設定された拡張領域が不明です";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "基本制約拡張領域がポリシーごとに必要ですが、存在していません";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "BasicConstraints.CA が無効です";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "認証局鍵 ID が無効です";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "所有者鍵 ID が無効です";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "鍵用途が無効なためポリシーを適用できません";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "拡張鍵用途が無効なためポリシーを適用できません";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "所有者／認証局鍵 ID リンクが無効です";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "PathLengthConstraint を超えています";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "証明書グループが、自己検証していないルート証明書で終了しました";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL の有効期限が切れているか、CRL がまだ有効になっていません";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "適切な CRL が見つかりません";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "指定された CRL サーバがダウンしています";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "CRL 配布ポイントの URL が判読できません";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "重要な証明書／CRL 拡張領域が不明です";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "アンカー（ルート）が CRL を検証できません";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "信頼されていないルートが CRL を検証しました";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "CRL がポリシーの検証に失敗しました";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "IssuingDistributionPoint 拡張領域違反";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "指定された issuerAltName で証明書が見つかりません";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "指定された issuerAltName から取得した証明書が正しくありません";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "S/MIME メールアドレスが一致しません";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "適切な S/MIME ExtendedKeyUsage が見つかりません";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "S/MIME KeyUsage に互換性がありません";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME：証明書の KeyUsage に !critical フラグが設定されています";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME：リーフの所有者名が空で、SubjectAltName にメールアドレス * がありません";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME：リーフの所有者名が空です。SubjectAltName * は重要ではありません";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "適切な SSL ExtendedKeyUsage が見つかりません";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "OCSP 応答を解析できません";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "OCSP 要求を解析できません";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "OCSP サービスが利用できません";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "OCSP の状況：証明書を認識できません";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "各証明書の失効チェックに失敗しました";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "一般的なネットワークエラー";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "アンカー（ルート）が OCSP 応答を検証できません";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "信頼されていないルートが OCSP 応答を検証しました";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "OCSP 応答の署名エラー";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "OCSP 応答の署名者が見つかりません";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "OCSP responder の状況：要求のフォーマットが正しくありません";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "OCSP responder の状況：内部エラー";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "OCSP responder の状況：後でやり直してください";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "OCSP responder の状況：署名が必要です";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "OCSP responder の状況：認証されていません";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "OCSP 応答 nonce が要求と一致しませんでした";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "証明書チェーンの長さが不正なためコードに署名できません";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "基本制約が見つからないためコードに署名できません";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "PathLengthConstraint が不正なためコードに署名できません";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "ExtendedKeyUsage がないためコードに署名できません";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "開発スタイルのコード署名証明書が検出されました";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "証明書チェーンの長さが不正なためリソースに署名できません";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "鍵が不正に拡張使用されているためリソースに署名できません";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "信頼設定：拒否";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "空の SubjectName は無効です";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "重要な条件付き証明書明細書 ID が不明です";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "証明書の要求がキューに入りました";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "証明書の要求がリダイレクトされました";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "一般的なサーバレポートエラー";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "サーバレポート - パラメータエラー";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "サーバレポート - 認証エラー";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "サーバレポート - 実装されていません";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "サーバレポート - 利用できません";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "サーバレポート - すでに存在しています";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "サーバレポート - サービスエラー";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "指定されたユーザの要求はすでに保留中です";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "指定されたユーザの保留中の要求はありません";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "CSR の検証に失敗しました";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "サーバレポート - 整合性チェックに失敗しました";

/* errSecCSUnimplemented */
"-67072" = "実装されていないコード署名機能です";

/* errSecCSInvalidObjectRef */
"-67071" = "API オブジェクトの参照が無効です";

/* errSecCSInvalidFlags */
"-67070" = "無効または不適切な API フラグが指定されています";

/* errSecCSObjectRequired */
"-67069" = "必要なポインタ引数が NULL でした";

/* errSecCSStaticCodeNotFound */
"-67068" = "コードオブジェクトがディスク上に見つかりません";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "この属性セットを使ってゲストを見つけることはできません";

/* errSecCSInvalidAttributeValues */
"-67066" = "指定された属性値が無効です";

/* errSecCSNoSuchCode */
"-67065" = "要求された属性を持つゲストがホストに存在しません";

/* errSecCSMultipleGuests */
"-67064" = "この属性値を持つゲストがホストに複数存在します";

/* errSecCSGuestInvalid */
"-67063" = "コード ID が無効になっています";

/* errSecCSUnsigned */
"-67062" = "コードオブジェクトが署名されていません";

/* errSecCSSignatureFailed */
"-67061" = "コードまたは署名が変更されています";

/* errSecCSSignatureNotVerifiable */
"-67060" = "ファイスシステムがルートをアクセス権のないユーザにマッピングしているなどの原因で、署名を読み込めません";

/* errSecCSSignatureUnsupported */
"-67059" = "対応していないタイプまたはバージョンの署名です";

/* errSecCSBadDictionaryFormat */
"-67058" = "必要な plist ファイルまたはリソースのフォーマットが正しくありません";

/* errSecCSResourcesNotSealed */
"-67057" = "リソースが署名によって封印されていません";

/* errSecCSResourcesNotFound */
"-67056" = "封印されたリソースがコード内に見つかりません";

/* errSecCSResourcesInvalid */
"-67055" = "封印されたリソースディレクトリが無効です";

/* errSecCSBadResource */
"-67054" = "封印されたリソースが見つからないか無効です";

/* errSecCSResourceRulesInvalid */
"-67053" = "リソース選択ルールが無効です";

/* errSecCSReqInvalid */
"-67052" = "無効なまたは破損しているコードが要求されました";

/* errSecCSReqUnsupported */
"-67051" = "対応していないタイプまたはバージョンのコードが要求されました";

/* errSecCSReqFailed */
"-67050" = "コード要件事項を満たせませんでした";

/* errSecCSBadObjectFormat */
"-67049" = "オブジェクトファイルのフォーマットが無効であるか適切ではありません";

/* errSecCSInternalError */
"-67048" = "コード署名サブシステムで内部エラーが起きました";

/* errSecCSHostReject */
"-67047" = "コードがそのホストを拒否しました";

/* errSecCSNotAHost */
"-67046" = "このコードはホストではありません";

/* errSecCSSignatureInvalid */
"-67045" = "署名のフォーマットが無効です";

/* errSecCSHostProtocolRelativePath */
"-67044" = "ホストプロトコル違反 - 絶対ゲストパスが必要です";

/* errSecCSHostProtocolContradiction */
"-67043" = "ホストプロトコル違反 - 矛盾したホスティングモードです";

/* errSecCSHostProtocolDedicationError */
"-67042" = "ホストプロトコル違反 - 操作は専用ゲストに対して許可されていません";

/* errSecCSHostProtocolNotProxy */
"-67041" = "ホストプロトコル違反 - プロキシホスティングと連動していません";

/* errSecCSHostProtocolStateError */
"-67040" = "ホストプロトコル違反 - ゲストの状態変更要求が無効です";

/* errSecCSHostProtocolUnrelated */
"-67039" = "ホストプロトコル違反 - 指定したゲストは指定したホストのゲストではありません";

/* errSecCSInvalidOperation */
"-67038" = "要求された操作は無効です";

/* errSecCSNotSupported */
"-67037" = "このタイプのコードでは、その操作はサポートされていません";

/* errSecCSCMSTooLarge */
"-67036" = "埋め込むには署名が長すぎます";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "ホストプロトコル違反 - ゲストのハッシュが無効です";

/* errSecCSStaticCodeChanged */
"-67034" = "ディスク上のプログラムが実行中のものと一致しません";

/* errSecCSSigDBDenied */
"-67033" = "署名データベースへのアクセスが拒否されました";

/* errSecCSSigDBAccess */
"-67032" = "署名データベースにアクセスできません";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "ホストによって、無効な、または一貫しないゲスト属性が返されました";

/* errSecMisc_dskFulErr */
"-34" = "ディスクに空きがありません。";

/* errSecMisc_nsvErr */
"-35" = "ディスクが見つかりませんでした。取り出されている可能性があります。";

/* errSecMisc_bdNamErr */
"-37" = "名前に不正な文字が含まれているファイルを開こうとしました。";

/* errSecMisc_fnfErr */
"-43" = "ファイルが見つかりませんでした。";

/* errSecMisc_wPrErr */
"-44" = "ディスクが書き込み保護されています。";

/* errSecMisc_fLckdErr */
"-45" = "ファイルがロックされています。";

/* errSecMisc_vLckdErr */
"-46" = "ボリュームがロックされています。";

/* errSecMisc_fBsyErr */
"-47" = "ファイルは使用中です。ほかのアプリケーションで使用されている可能性があります。";

/* errSecMisc_dupFNErr */
"-48" = "同じ名前のファイルがすでに存在します。";

/* errSecMisc_opWrErr */
"-49" = "ファイルは、すでに書き込み可能な形で開いています。";

/* errSecMisc_volOffLinErr */
"-53" = "ボリュームはもう使用できません。取り出されている可能性があります。";

/* errSecMisc_permErr */
"-54" = "ファイルを開けませんでした。ほかのアプリケーションで使用されている可能性があります。";

/* errSecMisc_extFSErr */
"-58" = "このボリュームは互換性がないようです。";

/* errSecMisc_wrPermErr */
"-61" = "ファイルに書き込めませんでした。ファイルを開くために必要なアクセス権がない可能性があります。";

/* errSecMisc_offLinErr */
"-65" = "記憶装置はもう使用できません。取り出されている可能性があります。";

/* errSecMisc_dirNFErr */
"-120" = "ディレクトリが見つかりませんでした。";

/* errSecMisc_volGoneErr */
"-124" = "サーバボリュームはもう使用できません。接続が解除された可能性があります。";

/* errSecMisc_userCanceledErr */
"-128" = "操作はユーザによってキャンセルされました。";

/* errSecMisc_resNotFound */
"-192" = "必要なリソースが見つかりませんでした。";

/* errSecMisc_resFNotFound */
"-193" = "必要なリソースが見つからないか、壊れています。";

/* errSecMisc_icNoURLErr */
"-673" = "指定された場所（URL）のタイプが不明か、情報が不足しています。";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "指定された URL を開くためのヘルパーアプリケーションが見つかりませんでした。";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "この項目の場所（URL）が見つからないか、フォーマットが正しくありません。";

/* errSecMisc_afpAccessDenied */
"-5000" = "この項目へのアクセスが拒否されました。";

/* errSecMisc_afpUserNotAuth */
"-5023" = "認証に失敗しました。このサーバに対するパスワードが、キーチェーンに項目を追加した後で変更された可能性があります。";
